{
  "personal_statement": "Driven and enthusiastic computer science graduate seeking an internship in tech to apply and expand my skills in real-world settings. With a strong academic record, sharp analytical thinking, and hands-on experience in AI-powered applications and software development, I bring both creativity and technical depth. I'm eager to contribute to impactful projects, learn from professional individuals, and thrive in an innovative environment.",

  "education": {
    "university": "University of Tabuk",
    "degree": "BSc in Computer Science",
    "honours": "First Class Honours",
    "gpa": "4.87/5",
    "dates": "Aug 2021 – May 2025"
  },

  "experience": [
    {
      "title": "IT Intern",
      "place": "General Administration of Information Technology at the University of Tabuk",
      "dates": "June 2024 – Aug 2024",
      "bullets": [
        "Gained practical knowledge in IT infrastructure and security policies.",
        "Created Use Case diagrams, flowcharts, and technical documentation as well as database management for software projects.",
        "Developed \"Technical Support System\", a full-stack web application using Angular and Django."
      ]
    },
    {
      "title": "Introductory Artificial Intelligence Training Program",
      "place": "KAUST Academy",
      "dates": "5 Jan 2025 – 9 Jan 2025",
      "bullets": [
        "Selected through an entry exam for a 40-hour intensive training on machine learning fundamentals.",
        "Designed and trained ML models with focus on preprocessing, evaluation, neural networks, regularization, and dimensionality reduction."
      ]
    }
  ],

  "relevant_skills": {
    "programming": "Java, Python, SQL, C#, LaTeX",
    "libraries": "Flask, React Native, HTML, CSS, node.js, Git, NumPy, Pandas, Pytesseract, Docker, Unity game engine",
    "other": "Strong understanding of software development principles and RAG pipeline. Experience with AI/ML model development, full-stack web applications, and mobile app development."
  },
  "projects": [
    {
    "projectName": "",
    "bullets":[
      "",
      ""
    ]
  },
      {
    "projectName": "",
    "bullets":[
      "",
      ""
    ]
  },
      {
    "projectName": "",
    "bullets":[
      "",
      ""
    ]
  }
    
  ]
}
